{
  "backend/main.mo": "Backend actor implementing access control, user profiles, moderation, video metadata, and Stripe configuration using OrderedMap and blob storage.",
  "feature_evidence.json": "Feature mapping document linking UX zoom changes and tests to affected frontend files and component versions with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend source files, components, pages, and configs.",
  "frontend/docs/dev-notes/react-185-video-page-crash.md": "Explains the root cause and fix for a React infinite‑loop crash on VideoPage caused by unstable mutation dependencies.",
  "frontend/docs/ops/live-smoke-check.md": "Operational checklist for manually validating core user flows after deployment, including home, video, pricing, and admin pages.",
  "frontend/docs/ops/rebuild-republish-runbook.md": "Instructions for performing a clean rebuild and republishing the application using DFX and admin credentials.",
  "frontend/index.html": "HTML entry point setting viewport constraints to disable mobile zoom and loading the React app root.",
  "frontend/src/App.tsx": "Root React application with router setup, global error boundary, layout structure, zoom‑prevention hook, and page route definitions.",
  "frontend/src/components/AdminVerificationBanner.tsx": "Displays an admin verification banner based on authentication, backend validation, and stored admin sessions, with dismiss functionality and persistent admin session handling.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links and styled gradient background.",
  "frontend/src/components/Header.tsx": "Provides the site header with navigation, authentication handling, and admin dropdown visibility based on backend or stored admin status.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter their name and saves the profile via a mutation.",
  "frontend/src/components/ShareButton.tsx": "Implements a share button that opens a dropdown allowing users to copy a video link or timestamped link.",
  "frontend/src/components/VideoGrid.tsx": "Displays video cards with thumbnails, metadata, sharing, and conditional delete actions based on ownership or admin rights.",
  "frontend/src/components/VideoRouteErrorBoundary.tsx": "Error boundary UI for video routes, displaying an error message and navigation option back home.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer (e.g., touch input) via a media query.",
  "frontend/src/hooks/usePreventPageZoom.ts": "Prevents mobile browsers from performing pinch and double‑tap zoom unless an element opts out.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for user profiles, video upload, thumbnail updates, and related mutations.",
  "frontend/src/hooks/useVideoPinchPan.ts": "Implements pinch‑to‑zoom and panning logic for video content with touch gesture handling and clamped transformations.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light/dark modes and applying global styles.",
  "frontend/src/lib/adminSession.ts": "Manages admin session persistence in local storage with versioning and validation helpers.",
  "frontend/src/main.tsx": "Application entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/pages/ArchitecturePage.tsx": "Renders a styled architecture overview page with a diagram and descriptions of system canisters and modules.",
  "frontend/src/pages/BannedWordsAdminPage.tsx": "Provides an admin‑only interface to view, modify, and save banned words and trigger re‑moderation of all videos.",
  "frontend/src/pages/FAQPage.tsx": "Displays FAQ content using an accordion, sourced from a fixed FAQ data object.",
  "frontend/src/pages/HomePage.tsx": "Home page showing featured videos, search, and category filtering with dynamic video loading.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with messaging and a link back to the homepage.",
  "frontend/src/pages/PaymentSettingsPage.tsx": "Empty placeholder file for future payment settings page.",
  "frontend/src/pages/PolicyPage.tsx": "Renders the community and ethics policy with structured sections and guidelines.",
  "frontend/src/pages/PricingPage.tsx": "Renders pricing plans, checks Stripe config, and handles redirects to checkout URLs for paid plans.",
  "frontend/src/pages/PrivacyPage.tsx": "Displays the platform’s privacy policy including data collection, usage, security, and user rights.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile and videos, with loading states and fallback UI when no videos exist.",
  "frontend/src/pages/SupportPage.tsx": "Provides support information, contact email, and troubleshooting guidance for platform issues.",
  "frontend/src/pages/TempStripeSettingsPage.tsx": "Admin-only page to view, edit, and reload Stripe configuration settings with form inputs and backend sync.",
  "frontend/src/pages/TermsPage.tsx": "Displays the platform’s terms of service, including usage rules, content responsibilities, and liability disclaimers.",
  "frontend/src/pages/UploadPage.tsx": "Handles video upload with metadata fields, thumbnail capture, progress tracking, and validation.",
  "frontend/src/pages/VideoPage.tsx": "React page that loads a video, metadata, comments, moderation status, and supports likes, comments, progress saving, thumbnail updates, zooming, and admin/owner actions.",
  "frontend/tailwind.config.js": "Tailwind config extending theme colors, radius, animations, and enabling dark mode, typography, and animate plugins.",
  "frontend/tests/smoke/smoke.spec.ts": "Playwright smoke tests that verify core routes load correctly, detect UI/console errors, and validate home, video, and pricing pages render properly.",
  "project_state.json": "No summary available."
}