{
  "backend/main.mo": "Main Motoko canister implementing access control, user profiles, video metadata/storage, moderation (banned words and results), and Stripe configuration with admin-only management and HTTP outcalls.",
  "feature_evidence.json": "Machine-readable report documenting two completed frontend FAQ-related features, listing affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend source files, pages, components, styles, and configuration used as high-level documentation for build and feature planning.",
  "frontend/docs/dev-notes/react-185-video-page-crash.md": "Developer postmortem explaining a resolved React infinite loop (error #185) on the VideoPage caused by unstable useEffect dependencies and fixed with useCallback.",
  "frontend/docs/ops/live-smoke-check.md": "Operational checklist for manually verifying critical routes (Home, Video, Pricing, Admin) after deployment to ensure the app is functioning correctly.",
  "frontend/docs/ops/rebuild-republish-runbook.md": "Operations runbook describing the step-by-step procedure for rebuilding and republishing the application using DFX after code or deployment changes.",
  "frontend/index.html": "HTML entry point defining metadata, page title, favicon assets, and mounting the React app at the root element.",
  "frontend/src/App.tsx": "Root React application configuring TanStack Router routes, global layout, theme provider, modals, toasts, and robust error boundaries to prevent blank screens.",
  "frontend/src/components/AdminVerificationBanner.tsx": "UI banner component that verifies admin status via backend and local storage, persists admin sessions, and displays a dismissible confirmation to authenticated admins.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a gradient background, copyright text, and navigation links to Pricing, Terms, Privacy, and Support using TanStack Router links.",
  "frontend/src/components/Header.tsx": "Implements the main sticky header with branding, navigation, authentication controls, and conditional admin dropdown based on Internet Identity login state and admin verification.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal prompting newly authenticated users without a profile to enter and save their name, handling validation, API mutation, and success/error toasts.",
  "frontend/src/components/ShareButton.tsx": "Provides a share button with a dropdown to copy a video link or a timestamped link to the clipboard, managing open/close state and click-outside behavior.",
  "frontend/src/components/VideoGrid.tsx": "Defines video card UI for a grid, showing thumbnails, uploader info, status badges, share/delete actions, and navigation to the video page with permission-aware deletion.",
  "frontend/src/components/VideoRouteErrorBoundary.tsx": "Error boundary UI for video routes that shows a friendly error message, optional dev-only details, and a button to navigate back to the home page.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context, provider, and hook for managing Internet Identity authentication, including login/logout, persisted identities, and detailed login status flags using Dfinity AuthClient.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "React hook that detects whether the device uses a coarse pointer (touch) via a media query and updates on pointer capability changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, video uploads, thumbnails, comments, admin checks, and other app data with caching and invalidation.",
  "frontend/src/hooks/useVideoPinchPan.ts": "React hook implementing touch-based pinch-to-zoom and pan behavior for video or media elements, with clamped scaling and translation within a container.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining design tokens, color variables, light/dark themes, and base styles for the application.",
  "frontend/src/lib/adminSession.ts": "Utility for persisting and validating an admin session in localStorage, including versioning to force revalidation and helpers to set, clear, and check admin status.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/ArchitecturePage.tsx": "Static informational page rendering a systems architecture overview with an image and descriptive sections about the multi-canister Internet Computer ecosystem.",
  "frontend/src/pages/BannedWordsAdminPage.tsx": "Admin-only page for managing a list of banned words used in content moderation, with UI to add/remove words, save changes, and rerun moderation across all videos.",
  "frontend/src/pages/FAQPage.tsx": "Static FAQ page rendering a predefined list of questions and answers about the platform using an accordion UI.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that displays featured videos, searchable and filterable video grids by category, and handles navigation, authentication state, and debounced search.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page that informs the user the route was not found and provides a button to navigate back to the home page.",
  "frontend/src/pages/PaymentSettingsPage.tsx": "Empty placeholder file intended for future payment or billing settings UI.",
  "frontend/src/pages/PolicyPage.tsx": "Static Community & Ethics Policy page outlining platform values, community guidelines, safety, privacy, and acceptable content standards.",
  "frontend/src/pages/PricingPage.tsx": "Pricing and plans page that lists Free, Pro, and Creator Plus tiers and integrates with Stripe configuration to redirect users to checkout for paid plans.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page describing what data is collected, how it is used, content privacy, security practices, and user rights.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page that requires authentication, fetches the caller’s profile and videos, shows loading skeletons, and displays the user avatar, name, and a grid of their uploaded videos or an empty-state message.",
  "frontend/src/pages/SupportPage.tsx": "Static support page with contact information, help topics, troubleshooting tips, and response time expectations, styled with prose typography.",
  "frontend/src/pages/TempStripeSettingsPage.tsx": "Admin-only settings page for viewing, updating, and reconnecting Stripe configuration (keys and plan URLs), with authentication checks, persisted admin sessions, and backend refetch/save actions.",
  "frontend/src/pages/TermsPage.tsx": "Static Terms of Service page describing platform usage rules, content responsibility, liability, and contact information.",
  "frontend/src/pages/UploadPage.tsx": "Authenticated video upload page that collects metadata, uploads video files, tracks progress, and supports capturing a thumbnail from the video using a canvas preview.",
  "frontend/src/pages/VideoPage.tsx": "Full video watch page handling playback, likes, comments, progress saving, moderation status, admin/owner actions (delete, thumbnail update), and advanced interactions like zoom and resume watching.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom color tokens via CSS variables, extended radii, animations, and typography/animation plugins.",
  "frontend/tests/smoke/smoke.spec.ts": "Playwright smoke test suite that validates critical post-deploy user flows, including home page rendering, video page navigation, and pricing page stability, while checking for visible error boundaries and critical console errors.",
  "project_state.json": "High-level project state and requirements snapshot for Xocial.Stream, documenting current branding, pricing strategy, reliability concerns, legal constraints, and a detailed registry of existing features like auth, RBAC, admin tooling, and user profiles."
}