{
  "backend/main.mo": "Motoko canister implementing core backend logic including access control, user roles and profiles, blob storage integration, Stripe subscription configuration, and video metadata/moderation state with persistent stable variables.",
  "feature_evidence.json": "Structured feature evidence report documenting the removal of the /faq page, related routes, and navigation links, including affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated JSON-style map summarizing the purpose and behavior of key frontend files and components for build and feature planning.",
  "frontend/docs/dev-notes/react-185-video-page-crash.md": "Developer note explaining the root cause of a React maximum update depth error on the VideoPage and how a useEffect cleanup with a mutation caused an infinite render loop.",
  "frontend/index.html": "HTML entry point for the React app defining metadata, page title, favicon assets, and mounting the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React application setup using TanStack Router with all route definitions, global layout (header, footer, banners, modals), theme provider, and not-found handling.",
  "frontend/src/components/AdminVerificationBanner.tsx": "UI banner component that verifies admin access via backend checks and local storage, persists admin sessions, and displays a dismissible admin confirmation alert.",
  "frontend/src/components/Footer.tsx": "Minimal footer component rendering copyright text and navigation links (Pricing, Terms, Privacy, Support) with gradient styling.",
  "frontend/src/components/Header.tsx": "Top navigation header handling authentication via Internet Identity, showing login/logout, user info, and conditional admin dropdown based on backend verification or stored admin session.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users without a profile to enter and save their display name before continuing.",
  "frontend/src/components/ShareButton.tsx": "Reusable share button that opens a dropdown to copy a video link or a timestamped link to the clipboard with toast feedback.",
  "frontend/src/components/VideoGrid.tsx": "Grid of video cards displaying thumbnails, uploader info, likes, status badges, and actions like play, share, and conditional delete for owners or admins.",
  "frontend/src/components/VideoRouteErrorBoundary.tsx": "Error boundary UI for video routes that shows a friendly error message and allows navigation back to the home page, with details in development mode.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook that manage Internet Identity authentication, login/logout flow, persisted identity loading, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend canisters, including user profiles, video upload and management, admin checks, moderation, and various video/category queries with cache invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, color variables, and light/dark theme styles applied across the application.",
  "frontend/src/lib/adminSession.ts": "Utility for persisting and validating an admin session in localStorage with versioning, revalidation, and forced reset support.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers.",
  "frontend/src/pages/ArchitecturePage.tsx": "Static informational page displaying a systems architecture diagram and descriptions of the multi-canister Internet Computer ecosystem.",
  "frontend/src/pages/BannedWordsAdminPage.tsx": "Admin-only page for managing banned words used in content moderation, with UI to add/remove words and re-run moderation across all videos.",
  "frontend/src/pages/FAQPage.tsx": "Placeholder or empty FAQ page file with no implemented content.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that displays featured videos, video listings, categories, and search functionality with debounced queries.",
  "frontend/src/pages/NotFoundPage.tsx": "404 error page that informs users a route was not found and provides a button to return to the home page.",
  "frontend/src/pages/PaymentSettingsPage.tsx": "Placeholder page for payment settings with no current implementation.",
  "frontend/src/pages/PolicyPage.tsx": "Renders a static Community & Ethics Policy page using cards and icons to outline platform values, commitments, and community guidelines.",
  "frontend/src/pages/PricingPage.tsx": "Displays pricing plans (Free, Pro, Creator Plus) and integrates with Stripe to handle paid plan checkout, including live configuration status and admin checks.",
  "frontend/src/pages/PrivacyPage.tsx": "Provides a static Privacy Policy page describing data collection, usage, security practices, and user rights.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile with avatar, video count, and a grid of their uploaded videos, including loading and empty states.",
  "frontend/src/pages/SupportPage.tsx": "Renders a static Support page with contact information, common help topics, response expectations, and basic troubleshooting tips.",
  "frontend/src/pages/TempStripeSettingsPage.tsx": "Admin-only page for viewing and partially updating Stripe configuration settings, with authentication checks, form controls, and persistence via backend APIs.",
  "frontend/src/pages/TermsPage.tsx": "Displays a static Terms of Service page outlining acceptable use, content responsibility, platform limitations, liability, and change policy.",
  "frontend/src/pages/UploadPage.tsx": "Implements the video upload page with form fields, category selection, authentication checks, upload progress/status handling, and client-side thumbnail capture from a selected video using canvas. Integrates upload mutations, toasts, and navigation after successful uploads.",
  "frontend/src/pages/VideoPage.tsx": "Implements the video watch page with playback, likes, comments, continue-watching resume, thumbnail updates, deletion, and sharing. Includes admin/owner controls, moderation status handling, and progress persistence via multiple query hooks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, extended theme tokens (colors, radius), animations, and plugins for animations and typography. Uses CSS variables and OKLCH color space for theming.",
  "project_state.json": "Project metadata snapshot describing the current product vision, UX decisions, deployed features, and historical context for Xocial.Stream. Enumerates existing features with IDs, versions, and descriptions to track system capabilities."
}