{
  "kind": "build_request",
  "title": "Adjust VideoPage zoom so it only activates after explicit user action",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Change the VideoPage in-video zoom UX so pinch-to-zoom/pan and the on-screen zoom controls do not activate/show automatically when the video is opened or when the user performs a normal first tap on the video; zoom must only become active after an explicit user action that indicates intent to zoom (e.g., tapping a dedicated “Enable Zoom” / “Zoom” control).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix zoom  adjust it so zoom only activates after a user action. BUILD"
        ]
      },
      "acceptanceCriteria": [
        "On VideoPage load, the video renders and behaves normally without entering any zoom interaction mode.",
        "A normal single tap on the video to reveal native video controls does not enable zoom or show custom zoom controls.",
        "Zoom interactions (pinch-to-zoom, pan, zoom in/out/reset buttons) only work after the user explicitly enables zoom via a dedicated UI control."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a clear, user-facing zoom enable/disable control on VideoPage for touch devices (coarse pointer) that toggles zoom mode: when zoom mode is disabled, do not attach pinch/pan touch handlers and do not opt the container into zoom-allowed behavior; when zoom mode is enabled, attach the pinch/pan handlers and allow the custom zoom system to work.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "adjust it so zoom only activates after a user action"
        ]
      },
      "acceptanceCriteria": [
        "When zoom mode is OFF, the video container does not set `data-allow-zoom=\"true\"` and does not set `touch-action: none` for coarse-pointer devices.",
        "When zoom mode is ON, the video container opts into the existing zoom-allowed mechanism (so custom pinch works) and uses the existing transform-based zoom/pan behavior.",
        "User-facing text for the toggle is in English (e.g., “Enable zoom” / “Disable zoom”)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update/extend the existing Playwright smoke coverage (or add a focused UI test) to prevent regression: verify that the VideoPage does not show custom zoom controls by default on initial render and that zoom controls only become visible/usable after enabling zoom mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix zoom"
        ]
      },
      "acceptanceCriteria": [
        "Automated test fails on the old behavior (zoom controls visible/active without explicit enable) and passes with the new behavior.",
        "Test uses stable selectors (add `data-testid` attributes on the zoom toggle and zoom controls container if needed)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/immutablePaths (e.g., frontend/src/main.tsx and shared UI components).",
    "Keep the existing global mobile page-zoom prevention behavior intact outside of the VideoPage zoom-mode opt-in behavior.",
    "Do not add new backend canisters or external services; this change must be implemented in the existing React frontend."
  ],
  "nonGoals": [
    "Changing the underlying zoom math/limits (min/max scale, clamp behavior) beyond what is required to gate activation behind explicit user intent.",
    "Adding new video features unrelated to zoom activation (uploads, playback progress, likes, comments, moderation, Stripe)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}