{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Gate VideoPage zoom interactions behind explicit user-enabled zoom mode",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent VideoPage zoom controls/handlers from activating on load or normal first tap; require explicit zoom-enable action before any zoom UI/gestures work.",
      "acceptanceCriteria": [
        "On VideoPage load, the video renders and behaves normally without entering any zoom interaction mode.",
        "A normal single tap on the video to reveal native video controls does not enable zoom or show custom zoom controls.",
        "Zoom interactions (pinch-to-zoom, pan, zoom in/out/reset buttons) only work after the user explicitly enables zoom via a dedicated UI control."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VideoPage.tsx",
          "operation": "modify",
          "description": "Introduce an explicit 'zoom mode' state (default OFF) and gate all custom zoom behavior behind it: do not render/show custom zoom controls by default, do not opt the container into zoom behavior by default, and ensure normal single taps on the video are not intercepted by custom zoom logic until zoom mode is enabled."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a clear zoom enable/disable toggle for coarse-pointer devices that attaches/detaches pinch/pan handlers and zoom opt-in only when enabled.",
      "acceptanceCriteria": [
        "When zoom mode is OFF, the video container does not set `data-allow-zoom=\"true\"` and does not set `touch-action: none` for coarse-pointer devices.",
        "When zoom mode is ON, the video container opts into the existing zoom-allowed mechanism (so custom pinch works) and uses the existing transform-based zoom/pan behavior.",
        "User-facing text for the toggle is in English (e.g., “Enable zoom” / “Disable zoom”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VideoPage.tsx",
          "operation": "modify",
          "description": "Implement a user-facing Zoom mode toggle UI for coarse-pointer devices (e.g., 'Enable zoom' / 'Disable zoom') and wire it to: (1) conditionally set/unset container `data-allow-zoom=\"true\"`, (2) conditionally apply `touch-action: none` only when enabled, (3) conditionally attach/detach pinch/pan touch handlers only when enabled, and (4) reset zoom/pan and hide zoom controls when disabling zoom mode."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add/extend Playwright coverage to ensure zoom controls are not shown by default and only appear after enabling zoom mode using stable selectors.",
      "acceptanceCriteria": [
        "Automated test fails on the old behavior (zoom controls visible/active without explicit enable) and passes with the new behavior.",
        "Test uses stable selectors (add `data-testid` attributes on the zoom toggle and zoom controls container if needed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VideoPage.tsx",
          "operation": "modify",
          "description": "Add stable `data-testid` attributes for Playwright to target (at minimum: a zoom mode toggle control and a zoom controls container), ensuring the controls container is not present/visible when zoom mode is disabled and becomes present/visible after enabling zoom mode on coarse-pointer devices."
        },
        {
          "path": "frontend/tests/smoke/smoke.spec.ts",
          "operation": "modify",
          "description": "Add a focused Playwright UI test (or extend the existing video navigation smoke test) that runs with a touch/coarse-pointer context, verifies the zoom controls are not visible on initial VideoPage render and remain hidden after a normal tap on the video, then enables zoom mode via the toggle and verifies the zoom controls become visible/usable using the `data-testid` selectors."
        }
      ]
    }
  ]
}