{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Xocial.Stream is a decentralized (Internet Computer) video upload and streaming web application. Users authenticate via Internet Identity, create a simple profile, upload videos with metadata, and watch videos with likes, comments, sharing (copy link + timestamp), and per-user playback resume (“continue watching”). The app includes a Plans & Pricing page with Free/Pro/Creator Plus tiers and Stripe subscription integration via admin Payment Settings (keys + plan URLs), plus community policy/terms/privacy/support pages. Admin-only UI is grouped in an Admin dropdown; admins can manage payment settings and moderation/policy controls, and users can delete their own videos. The product emphasizes a clean, ethical, non-algorithmic experience.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication",
      "synonyms": [
        "II auth",
        "AuthClient login/logout",
        "DelegationIdentity session restore"
      ],
      "description": "Provides login/logout via Internet Identity, restores stored delegation on reload, exposes detailed authentication state flags, and supports long-lived sessions (configured maxTimeToLive).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation tied to identity",
      "synonyms": [
        "useActor",
        "authenticated canister actor"
      ],
      "description": "Creates an anonymous actor when unauthenticated and an identity-backed actor when authenticated; calls initializeAccessControl() after login and invalidates/refetches React Query data when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Backend role-based access control (RBAC)",
      "synonyms": [
        "access-control",
        "admin/user/guest roles"
      ],
      "description": "Enforces user/admin permissions on backend endpoints; first initializer becomes admin; admins can assign roles and access privileged endpoints.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Persistent admin session caching",
      "synonyms": [
        "adminSession",
        "localStorage admin principal"
      ],
      "description": "Caches verified admin status in localStorage with a session-version mechanism; supports forced reactivation/revalidation to clear stale sessions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Admin verification banner and admin navigation",
      "synonyms": [
        "AdminVerificationBanner",
        "admin dropdown",
        "verifyAdminAccess"
      ],
      "description": "Verifies admin access via backend (or restores from localStorage) and conditionally shows admin UI/navigation (Stripe settings and moderation tools).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "User profile storage and onboarding modal",
      "synonyms": [
        "UserProfile",
        "ProfileSetupModal"
      ],
      "description": "Stores a minimal user profile (name) in the backend; prompts new authenticated users to set a name; Profile page displays the caller profile and their videos.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Video upload with metadata and progress reporting",
      "synonyms": [
        "UploadPage",
        "uploadVideo",
        "ExternalBlob upload"
      ],
      "description": "Allows authenticated users to upload videos with title/description/category; streams file bytes via ExternalBlob and supports upload progress callbacks; UI shows uploading and processing states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Thumbnail capture and custom thumbnail updates",
      "synonyms": [
        "capture thumbnail from video",
        "updateThumbnail"
      ],
      "description": "Upload flow can capture a thumbnail frame using an offscreen <video> and <canvas>; owners/admins can upload a custom thumbnail for an existing video with ThumbnailType.custom.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Video listing, grid UI, and navigation",
      "synonyms": [
        "HomePage video grid",
        "VideoGrid",
        "video cards"
      ],
      "description": "Displays videos in a responsive grid with thumbnail, category/status badges, like count, share action, and permission-aware delete controls; supports navigation to /video/:id.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Featured videos",
      "synonyms": [
        "getFeaturedVideos",
        "setFeaturedStatus"
      ],
      "description": "Backend supports marking videos as featured; homepage renders a featured section using getFeaturedVideos() (filtered by moderation).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Video playback page with sharing and management actions",
      "synonyms": [
        "VideoPage",
        "ShareButton",
        "delete video"
      ],
      "description": "Plays videos with a poster thumbnail, shows metadata, supports sharing a plain link and timestamp link, and provides owner/admin actions (delete video; upload custom thumbnail).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Likes system",
      "synonyms": [
        "likeVideo",
        "unlikeVideo",
        "likeCount"
      ],
      "description": "Authenticated users can like/unlike videos; backend prevents double-likes and maintains like counts; frontend invalidates relevant queries to keep lists/details fresh.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Comments system",
      "synonyms": [
        "addComment",
        "getComments",
        "deleteComment"
      ],
      "description": "Authenticated users can add/list comments on videos and delete their own; admins can delete any comment; UI refreshes via React Query invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Search and category filtering",
      "synonyms": [
        "searchVideos",
        "getVideosByCategory",
        "searchVideosByCategory"
      ],
      "description": "Supports searching videos by title/description, filtering by category, and combined search+category filtering; provides a categories endpoint for UI category buttons.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Free plan upload limit tracking",
      "synonyms": [
        "10 uploads per month",
        "getFreePlanStatus"
      ],
      "description": "Backend tracks per-user plan data and enforces a Free plan limit of 10 uploads per month; exposes remaining uploads via getFreePlanStatus().",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Continue watching (per-user playback progress)",
      "synonyms": [
        "video progress",
        "resume playback",
        "saveVideoProgress/getVideoProgress"
      ],
      "description": "Persists per-user per-video progress in the backend and resumes playback after metadata loads; progress is throttled and also saved on pause, visibility change, and unmount.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Content moderation via banned words",
      "synonyms": [
        "banned words filter",
        "moderationResults",
        "blocked videos"
      ],
      "description": "Backend moderates videos by scanning title/description against an admin-configured banned-words list; blocked content is prevented at upload and filtered out from public listing/video retrieval; likes/comments are also blocked for moderated videos.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Admin moderation tools (UI + actions)",
      "synonyms": [
        "BannedWordsAdminPage",
        "overrideModerationStatus",
        "rerunModeration/rerunModerationAll"
      ],
      "description": "Admin-only UI for managing banned words and re-scanning all videos; VideoPage includes an admin moderation panel for per-video allow/block override and re-scan.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Stripe configuration storage (public vs admin)",
      "synonyms": [
        "StripeConfigAndUrls",
        "getPublicStripeConfigAndUrls",
        "getFullStripeConfigAndUrls"
      ],
      "description": "Backend stores Stripe keys and plan checkout URLs. Public endpoint omits secret key; admin endpoint returns full config; admin updates support partial updates and clearing values via empty strings.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Pricing page with Stripe checkout redirects",
      "synonyms": [
        "PricingPage",
        "Stripe plan URLs"
      ],
      "description": "Renders Free/Pro/Creator Plus plans and redirects to configured Stripe Checkout URLs for paid plans; shows terminal-state messaging when config is missing and provides an admin shortcut to Stripe settings.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Stripe API integration via IC HTTP outcalls",
      "synonyms": [
        "createCheckoutSession",
        "getStripeSessionStatus",
        "http_request outcall"
      ],
      "description": "Backend can perform Stripe API calls using IC http_request outcalls with a transform function to strip headers, supporting checkout session creation and session status queries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Admin Stripe settings UI",
      "synonyms": [
        "TempStripeSettingsPage",
        "updateStripeConfigAndUrls"
      ],
      "description": "Admin-only page to load, reload-from-backend, edit, save, and clear Stripe keys and checkout URLs; uses persistent admin session and React Query invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Global mobile page-zoom prevention with opt-out areas",
      "synonyms": [
        "disable pinch-to-zoom",
        "disable double-tap zoom",
        "usePreventPageZoom"
      ],
      "description": "Globally prevents mobile browser pinch/double-tap page zoom while preserving normal scrolling; allows specific containers to opt out via data-allow-zoom=\"true\".",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "In-video pinch-to-zoom and pan controls",
      "synonyms": [
        "useVideoPinchPan",
        "custom player zoom"
      ],
      "description": "Implements touch pinch-to-zoom and one-finger pan (when zoomed) for the video player using transform translate/scale with clamped bounds; includes on-screen zoom controls for coarse pointer devices.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Error boundaries and route-level crash containment",
      "synonyms": [
        "AppErrorBoundary",
        "VideoRouteErrorBoundary",
        "TanStack Router errorComponent"
      ],
      "description": "Provides a root app-level error boundary to avoid blank screens and a /video/:id-specific error boundary with fallback UI and safe navigation back to home.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Operational smoke checks and Playwright smoke test skeleton",
      "synonyms": [
        "live smoke check docs",
        "smoke.spec.ts"
      ],
      "description": "Includes manual deployment verification docs for critical routes and a lightweight Playwright smoke test suite skeleton for basic regression detection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Static informational pages",
      "synonyms": [
        "Policy",
        "Terms",
        "Privacy",
        "Support",
        "FAQ",
        "Architecture"
      ],
      "description": "Provides multiple static pages (Community & Ethics Policy, Terms, Privacy, Support, FAQ, Architecture overview) as part of the product experience.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Camera capture and QR scanning hooks",
      "synonyms": [
        "useCamera",
        "useQRScanner",
        "jsQR integration"
      ],
      "description": "Implements reusable browser camera utilities (start/stop/switch/capture) and a QR scanner hook that dynamically loads jsQR and scans frames on an interval.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-change-the-videopage-in-video-zoom-ux-so-pinch-to-zoom-pan-and-the-on-screen-zoom-controls-do-not-activate-show-automatically-when-the-video-is-opened-or-when-the-user-performs-a-normal-first-tap-on-the-video-zoom-must-only-become-active-after-an-explicit-user-action-that-indicates-intent-to-zoom-e-g-tapping-a-dedicated-enable-zoom-zoom-control",
      "title": "Change the VideoPage in-video zoom UX so pinch-to-zoom/pan and the on-screen zoom controls do not activate/show automatically when the video is opened or when the user performs a normal first tap on the video; zoom must only become active after an explicit user action that indicates intent to zoom (e.g., tapping a dedicated “Enable Zoom” / “Zoom” control).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-a-clear-user-facing-zoom-enable-disable-control-on-videopage-for-touch-devices-coarse-pointer-that-toggles-zoom-mode-when-zoom-mode-is-disabled-do-not-attach-pinch-pan-touch-handlers-and-do-not-opt-the-container-into-zoom-allowed-behavior-when-zoom-mode-is-enabled-attach-the-pinch-pan-handlers-and-allow-the-custom-zoom-system-to-work",
      "title": "Implement a clear, user-facing zoom enable/disable control on VideoPage for touch devices (coarse pointer) that toggles zoom mode: when zoom mode is disabled, do not attach pinch/pan touch handlers and do not opt the container into zoom-allowed behavior; when zoom mode is enabled, attach the pinch/pan handlers and allow the custom zoom system to work.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-update-extend-the-existing-playwright-smoke-coverage-or-add-a-focused-ui-test-to-prevent-regression-verify-that-the-videopage-does-not-show-custom-zoom-controls-by-default-on-initial-render-and-that-zoom-controls-only-become-visible-usable-after-enabling-zoom-mode",
      "title": "Update/extend the existing Playwright smoke coverage (or add a focused UI test) to prevent regression: verify that the VideoPage does not show custom zoom controls by default on initial render and that zoom controls only become visible/usable after enabling zoom mode.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix/adjust mobile in-video zoom so zoom only activates after an explicit user action (not automatically on video open).",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add/restore an FAQ page using the exact approved Xocial.Stream FAQ copy (word-for-word, no edits).",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Computer (ICP) Motoko canister backend that combines access control, video metadata storage, moderation state, Stripe config storage, and optional Stripe HTTP outcalls.",
    "Role-based access control (RBAC) enforced on the backend; first non-anonymous principal to initialize becomes admin, subsequent users become standard users.",
    "Frontend uses TanStack Router for routing and TanStack React Query as the primary data-fetching/cache/invalidation layer via a centralized set of hooks.",
    "Backend access is encapsulated via a React hook (useActor) that creates anonymous vs authenticated actors depending on Internet Identity and calls initializeAccessControl() after login.",
    "Large binary uploads are sent to the backend using ExternalBlob abstractions; thumbnails are uploaded similarly.",
    "Admin UX uses a persistent localStorage-based admin session (principal + session version) with forced revalidation when the session version changes.",
    "Mobile UX includes global prevention of browser page zoom (pinch/double-tap) with a per-container opt-out via data-allow-zoom=\"true\" to preserve custom zoom areas.",
    "Video page implements custom in-video pinch-to-zoom and pan using CSS transforms and touch gesture handling, separate from browser zoom.",
    "UI layer is built with TailwindCSS and shadcn/ui components; notifications use sonner; icons use lucide-react.",
    "Reliability practices include route-level error boundaries (notably /video/:id) plus operational smoke-check docs and a Playwright smoke test skeleton."
  ],
  "known_issues": [
    "Backend canister state (videos, comments, likes, profiles, moderation results, progress history, Stripe config) is stored in non-stable variables; upgrades risk wiping state unless stable memory/persistence is added.",
    "Uploader profile privacy/authorization mismatch: getUserProfile() only allows the caller or an admin, so other users typically cannot see uploader names; the UI therefore often falls back to “Anonymous.”",
    "VideoPage “liked” UI state is local-only (isLiked) and is not initialized from backend per-user like status, so the button state can be wrong on first load/refresh.",
    "Blocked video UX for non-admins: blocked videos are filtered to null by getVideo(), so users may see “Video not found” rather than an explicit “blocked/unavailable” message (the blocked-state UI depends on admin-only moderationResult).",
    "Stripe checkout session form body bug: buildCheckoutSessionBody() writes shipping_address_collection[allowed_countries][0] for every country (overwriting index 0) instead of incrementing indices.",
    "Free plan monthly reset uses a naive time-to-month approximation (30-day/365-day math) which can drift from real calendar months and reset counts incorrectly.",
    "Comment IDs are generated from Time.now() stringification; rapid submissions could collide—use a counter/UUID for safer uniqueness.",
    "getAllCategories() lowercases and sorts but does not deduplicate, potentially producing duplicates and losing original casing.",
    "FeaturedVideoCard on HomePage currently uses a static default thumbnail image and does not render the actual per-video thumbnail even when available.",
    "Playwright pricing smoke test assertions appear out of sync with current PricingPage button labels/state logic (tests expect “Get Started/Coming Soon” while UI uses “Unavailable/Choose …”)."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Xocial.Stream",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}